<?php

if (!defined('ABSPATH')) {
    die('Don\'t hack please!');
}

?>
<div class="tip">
    <div class="card">
        <h3>Hint</h3>

        <p>1. The site consists of files and a MySQL database - so
            <br>you need to go to phpMyAdmin in hosting 
            <br>to copy all components. Don't worry, that is simple!</p>
        <p>2. For full optimization you will need ability to work with 
            <br>files of website through FTP manager. We recommend
            <br> to use FTP and to do backup through FileZilla.
            <br> (point A of "Through the file manager" section)</p>
        <p>2. Save MySQL info(shown below) - that can be used to enter to
           	<br>phpMyAdmin/Adminer for saving/editing and restoring of MySQL base.

    </div>
    <div class="card">

        <h3>MySQL info:</h3>
        <ul>
            <li><strong>Database name:</strong> <code><?php echo DB_NAME ?></code></li>
            <li><strong>Username:</strong> <code><?php echo DB_USER ?></code></li>
            <li><strong>Password:</strong> <code><?php echo DB_PASSWORD ?></code></li>
            <li><strong>Server name:</strong> <code><?php echo DB_HOST ?></code></li>
            <li><strong>Encoding of base:</strong> <code><?php echo DB_CHARSET ?></code></li>
        </ul>

    </div>
</div>

<h2>Step 2/7. <span class="name">Creating backup of FTP/MySQL</span></h2>

<p>Create backup of files to save original version of site and protect yourself from errors.</p>

<p><strong><font color="red">Attention:</font></strong> the information is written in Russian. To translate, use <a href="https://chrome.google.com/webstore/detail/google-translate/aapbdbdomjkkjkaonfhkkikfgjllcleb?hl=en" target="_blank">Google Translate</a> (browser plugin)</p>

<h4>I. Рассмотрим способы создания совместно бэкапа (сразу MySQL и FTP):</h4>

<h4>Способ 1 (хостинговый)</h4>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">А) Через систему бэкапов хостера NIC.RU</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Получение резервной копии сайта на виртуальном хостинге nic.ru</strong></p>
        <p>Виртуальный хостинг nic.ru предлагает своим клиентам услуги по автоматическому созданию резервных копий
            сайта. Бэкапы формируются каждый день и сохраняются на сервере в течение недели. Чтобы обезопасить свой
            сайт, рекомендуем регулярно скачивать актуальные бэкапы на компьютер. Вот как это сделать.</p>
        <p>1. Авторизуйтесь в панели управления хостингом (располагается по ссылке <a href="https://www.nic.ru/hcp2/" target="_blank">https://www.nic.ru/hcp2/</a>),
            используя данные, предоставленные провайдером.</p>
        <img src="<?php WP01_Content::the_image_src('nic/1.png') ?>" alt="img">
        <p>2. Перейдите в раздел «Резервные копии». Перед вами появится вкладка «Файлы», где необходимо указать, бэкап
            от какого числа вы желаете получить. Рекомендуем выбрать последнюю созданную резервную копию.</p>
        <img src="<?php WP01_Content::the_image_src('nic/2.png') ?>" alt="img">
        <p>3. Кликните по названию сайта и сохраните архив на компьютер. Он содержит как сами файлы WordPress, так и
            резервную копию базы данных.</p>
        <img src="<?php WP01_Content::the_image_src('nic/3.png') ?>" alt="img">
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">Б) Через систему бэкапов хостера REG.RU</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Получение резервной копии сайта на виртуальном хостинге reg.ru</strong></p>
        <p>Пользователям виртуального хостинга reg.ru не требуется создавать резервные копии вручную, так как вся
            процедура автоматизирована. Бэкапы создаются ежедневно, в период от 0:00 до 2:00 по московскому времени, и
            хранятся на сервере в течение 30 суток, после чего удаляются. Поэтому мы рекомендуем всегда скачивать
            актуальные версии резервных копий на свой компьютер. Давайте посмотрим, как это сделать.</p>
        <p>1. Авторизуйтесь на сайте, затем перейдите по ссылке <a href="https://www.reg.ru/user/service_list" target="_blank">https://www.reg.ru/user/service_list</a>.
        </p>
        <p><img src="<?php WP01_Content::the_image_src('reg/1.png') ?>" alt="img" width="600"></p>
        <p>2. Выберите нужную услугу хостинга в графе «Домен/Услуга».</p>
        <p><img src="<?php WP01_Content::the_image_src('reg/2.png') ?>" alt="img" width="600"></p>
        <p>3. На следующей странице в блоке «Управление услугой» кликните по «Управление резервными копиями».</p>
        <p><img src="<?php WP01_Content::the_image_src('reg/3.png') ?>" alt="img" width="600"></p>
        <p>4. Хостинг reg.ru позволяет скачать резервную копию всего вашего аккаунта, архив с файлами всех ваших сайтов
            (если таковых у вас несколько), архив, содержащий все базы данных, либо корневой каталог и базу данных
            конкретного сайта. Чтобы получить полную резервную копию сайта, необходимо сохранить на компьютер не только
            файлы корневого каталога, но и дамп базы данных MySQL.</p>
        <p><img src="<?php WP01_Content::the_image_src('reg/4.png') ?>" alt="img" width="600"></p>
        <p>5. Кликните по «Сформировать архив» напротив строк с резервными копиями файлов вашего сайта и его базой
            данных. Перед этим можете также проставить галочку в чекбокс «Выслать ссылку на почту»: в этом случае на
            E-mail администратора придет электронное письмо, содержащее ссылку на скачивание.</p>
        <p><img src="<?php WP01_Content::the_image_src('reg/5.png') ?>" alt="img" width="600"></p>
        <p>6. Вскоре архив будет готов. Обновите страницу спустя некоторое время и нажмите на кнопку загрузки, либо
            дождитесь письма со ссылкой.</p>
        <p><img src="<?php WP01_Content::the_image_src('reg/6.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">В) Через систему бэкапов панели cPanel</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Создание резервной копии сайта в панели управления хостингом cPanel</strong></p>
        <p>Популярная панель управления виртуальным хостингом cPanel используется многими российскими и зарубежными
            провайдерами. Ее функционал позволяет создать полную резервную копию вашего аккаунта, которая будет включать
            в себя копии файлов и баз данных всех принадлежащих вам сайтов, а также настроек хостинга. Рассмотрим, как
            создать бэкап вручную.</p>
        <p><strong>1. Работа с мастером резервного копирования</strong></p>
        <p>1.1. Авторизуйтесь в панели управления используя данные, предоставленные вашим провайдером. Перейдите в
            раздел «Мастер резервного копирования».</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/1.png') ?>" alt="img" width="600"></p>
        <p>1.2. Мастер начнет свою работу. На первом шаге выберите вариант «Back Up» (собственно, создание резервной
            копии).</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/2.png') ?>" alt="img" width="600"></p>
        <p>1.3. На втором шаге система предложит выбрать, какую именно резервную копию необходимо создать: полную или
            частичную.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/3.png') ?>" alt="img" width="600"></p>
        <p>Здесь присутствует несколько опций:</p>
        <ul>
            <li>«Полная резервная копия» — такой бэкап включает в себя все файлы, базы данных и настройки хостинга,
                однако, не позволяет восстановить исходное состояние вашего аккаунта самостоятельно: для этого придется
                обратиться в техническую поддержку хостинга;
            </li>
            <li>«Корневой каталог» — как следует из названия, дает возможность создать резервную копию корневого
                каталога, содержащую файлы принадлежащих вам сайтов;
            </li>
            <li>«Базы данных MySQL» — здесь можно выборочно скачать базу данных конкретного сайта, выбрав нужную из
                списка;
            </li>
            <li>«Серверы пересылки электронной почты и фильтры» — позволяет создать резервную копию ваших писем и
                настроек E-mail.
            </li>
        </ul>
        <p>Нас интересуют первые три опции — их мы и рассмотрим подробнее.</p>
        <p><strong>2. Создание и загрузка полной резервной копии</strong></p>
        <p>2.1. Кликните по кнопке «Полная резервная копия». </p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/4.png') ?>" alt="img" width="600"></p>
        <p>2.2. Выберите, куда желаете сохранить бэкап («Назначение резервной копии»). По умолчанию указан корневой
            каталог (именно этот вариант и следует оставить). </p>
        <p>Опытные пользователи могут также выбрать удаленный FTP-сервер или выгрузку бэкапа по протоколу SSH.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/5.png') ?>" alt="img" width="600"></p>
        <p>В графе ниже можно выбрать адрес электронной почты, на который придет отчет о создании резервной копии (по
            умолчанию — E-mail администратора), либо отказаться от уведомлений.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/6.png') ?>" alt="img" width="600"></p>
        <p>2.3. Нажмите на «Создать резервную копию» и дождитесь окончания процесса.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/7.png') ?>" alt="img" width="600"></p>
        <p>2.4. Вернитесь в главное меню панели cPanel, затем перейдите в раздел «Резервные копии».</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/8.png') ?>" alt="img" width="600"></p>
        <p>2.5. В блоке «Полная резервная копия» нажмите на «Загрузить полную резервную копию веб-сайта».</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/9.png') ?>" alt="img" width="600"></p>
        <p>2.6. На следующей странице найдите архив с актуальной датой в блоке «Доступные для скачивания резервные
            копии», кликните по ссылке и сохраните архив на свой компьютер.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/10.png') ?>" alt="img" width="600"></p>
        <p><strong>3. Создание и загрузка резервной копии корневого каталога</strong></p>
        <p>3.1. Запустив мастер резервного копирования, выберите вариант «Корневой каталог» на втором шаге.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/11.png') ?>" alt="img" width="600"></p>
        <p>3.2. Нажмите на кнопку «Корневой каталог» в следующем окне и сохраните полученный архив на свой
            компьютер.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/12.png') ?>" alt="img" width="600"></p>
        <p><strong>4. Создание и загрузка резервной копии базы данных</strong></p>
        <p>4.1. После запуска мастера резервного копирования выберите на втором шаге опцию «Базы данных MySQL».</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/13.png') ?>" alt="img" width="600"></p>
        <p>4.2. На следующей странице найдите нужную базу данных, кликните по ее названию и сохраните файл на свой
            компьютер.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel/14.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">Г) Через систему бэкапов панели DirectAdmin</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Создание резервной копии сайта в панели управления хостингом DirectAdmin</strong></p>
        <p>Панель управления хостингом DirectAdmin позволяет создать резервную копию всего вашего аккаунта. Это 
		означает, что если вы имеете в своем распоряжении несколько сайтов, то в бэкап будут добавлены все имеющиеся 
		файлы и базы данных WordPress. Кроме того, DirectAdmin сохраняет служебную информацию о настройках хостинга, 
		что тоже весьма удобно. Разберемся, как это работает.</p>
        <p>1. Зайдите в панель управления, используя логин и пароль, полученные у провайдера, и перейдите на страницу 
		«Резервное копирование» (блок «Доп. возможности»).</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin/1.png') ?>" alt="img" width="600"></p>
        <p>2. На следующем этапе необходимо выбрать элементы, которые будут включены в резервную копию. Конкретно за 
		резервное копирование сайтов отвечают блоки «Данные сайта» и «Базы данных», однако по умолчанию галочки 
		проставлены во всех пунктах, благодаря чему к архиву добавляются настройки почтового и FTP-сервера, что 
		достаточно удобно. Нажмите на «Создать резервную копию».</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin/2.png') ?>" alt="img" width="600"></p>
        <p>3. На экране появится сообщение о том, что бэкап добавлен в очередь. Через некоторое время его 
		формирование будет завершено.</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin/3.png') ?>" alt="img" width="600"></p>
        <p><strong>Загрузка резервной копии</strong></p>
        <p>1. Найти созданные резервные копии можно, перейдя в раздел «Файлы».</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin/4.png') ?>" alt="img" width="600"></p>
        <p>2. Как правило, резервные копии располагаются в папке «backups» и носят название «backup-мес-дд-гггг». 
		Для того, чтобы скачать резервную копию, щелкните по ссылке на бэкап левой кнопкой мыши, после чего браузер 
		предложит сохранить архив на ваш компьютер.</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin/5.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>

<h4>Способ 2 (плагинный)</h4>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">А) Через плагин UpdraftPlus WordPress Backup Plugin</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Резервное копирование сайта посредством плагина UpdraftPlus</strong></p>
        <p>Плагин UpdraftPlus относится к категории «shareware»: многие функции в бесплатной версии недоступны, однако,
            имеющихся возможностей вполне достаточно для создания резервных копий. Ключевым преимуществом данного
            расширения является возможность восстановления бэкапа непосредственно из интерфейса админки без
            использования сторонних скриптов или программ. Давайте создадим резервную копию с его помощью.</p>
        <p><strong>1. Установка и активация</strong></p>
        <p>1.1. Перейдите в панель управления сайтом, раздел «Плагины», и кликните по кнопке «Добавить новый».</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/1.png') ?>" alt="img" width="600"></p>
        <p>1.2. Введите ключевое слово «UpdraftPlus» в строку поиска и нажмите на «Установить» в карточке плагина.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/2.png') ?>" alt="img" width="600"></p>
        <p>1.3. Дождитесь завершения установки, затем нажмите на «Активировать».</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/3.png') ?>" alt="img" width="600"></p>
        <p>1.4. Вы будете перенаправлены на страницу со списком установленных плагинов, где необходимо кликнуть по
            ссылке «Настройки», о чем подсказывает и сам плагин.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/4.png') ?>" alt="img" width="600"></p>
        <p><strong>2. Создание резервной копии</strong></p>
        <p>2.1. UpdraftPlus не требует дополнительных настроек, поэтому для создания бэкапа можно сразу же нажать на
            кнопку «Создать РК сейчас».</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/5.png') ?>" alt="img" width="600"></p>
        <p>2.2. На следующем шаге можно выбрать опции резервной копии. Проставьте галочки в чекбоксах «Include the
            database in the backup», чтобы включить в архив базу данных, и «Include your files in the backup» для
            добавления файлов сайта.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/6.png') ?>" alt="img" width="600"></p>
        <p>2.3. UpdraftPlus позволяет вручную указать таблицы базы данных (только в Premium-версии) и директории,
            которые необходимо добавить в бэкап. Чтобы это сделать, щелкните по «(...)» напротив соответствующего
            пункта. По умолчанию выбраны все имеющиеся папки в директории wp-content.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/7.png') ?>" alt="img" width="600"></p>
        <p>2.4. Поставьте галочку в чекбокс «Only allow this backup deleted manually», если хотите дополнительно
            защитить резервную копию (данная опция исключает автоматическое удаление бэкапа), и нажмите на «Создать РК
            сейчас».</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/8.png') ?>" alt="img" width="600"></p>
        <p>2.5. Дождитесь окончания выполнения скрипта. Ни в коем случае не закрывайте страницу, иначе создание бэкапа
            прервется.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/9.png') ?>" alt="img" width="600"></p>
        <p>2.6. Об успешной архивации просигнализирует всплывающее окно.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/10.png') ?>" alt="img" width="600"></p>
        <p><strong>3. Загрузка резервной копии</strong></p>
        <p>Созданные резервные копии появляются в списке на главной странице плагина.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/11.png') ?>" alt="img" width="600"></p>
        <p>UpdraftPlus позволяет скачивать файлы бэкапа по отдельности. Например, для загрузки базы данных необходимо
            кликнуть на одноименную кнопку, а затем в появившемся выше блоке кликнуть по «Скачать на компьютер».</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/12.png') ?>" alt="img" width="600"></p>
        <p>Для сохранения резервной копии на свой компьютер повторите процедуру скачивания для всех компонентов в
            списке:</p>
        <ul>
            <li>база данных;</li>
            <li>дополнения;</li>
            <li>темы;</li>
            <li>загрузки;</li>
            <li>другое.</li>
        </ul>
        <p>Рекомендуем создавать отдельные папки под каждую резервную копию</p>
        <p><strong>Дополнительные возможности плагина UpdraftPlus</strong></p>
        <p>Многие опции плагина доступны и в бесплатной версии. Для работы с ними необходимо перейти во вкладку
            «Настройки».</p>
        <p><strong>1. Резервное копирование по расписанию</strong></p>
        <p>В верхнем блоке можно указать периодичность автоматического резервного копирования файлов и базы данных (по
            умолчанию задано ручное), а также количество сохраненных резервных копий.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/13.png') ?>" alt="img" width="600"></p>
        <p><strong>2. Облачное хранение бэкапов</strong></p>
        <p>Предусмотрена возможность подключения внешних хранилищ (бесплатно доступны FTP-сервер, Amazon и
            S3-совместимые хранилища, OpenStack, Rackspace, Google Drive и отправка архива на E-mail).</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/14.png') ?>" alt="img" width="600"></p>
        <p><strong>3. Тонкая настройка архивирования</strong></p>
        <p>Опытные пользователи могут выбрать, какие элементы добавлять к архиву при формировании автоматических
            бэкапов.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/15.png') ?>" alt="img" width="600"></p>
        <p><strong>4. Уведомления по E-mail</strong></p>
        <p>Проставив галочку в соответствующий чекбокс, можно включить отправку отчетов о ходе резервного копирования на
            почту администратора сайта.</p>
        <p><img src="<?php WP01_Content::the_image_src('updraftplus/16.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">Б) Через плагин BackUpWordPress</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Резервное копирование с применением плагина BackUpWordpress</strong></p>
        <p>BackUpWordpress — полностью бесплатный плагин, позволяющий создавать резервные копии вручную или по
            расписанию. Среди его преимуществ необходимо выделить стабильность работы, наглядный интерфейс и минимальное
            количество настроек. Рассмотрим, как сделать бэкап с его помощью.</p>
        <p><strong>1. Установка и активация</strong></p>
        <p>1.1. Перейдите в админ-панель сайта, откройте раздел «Плагины» и кликните по «Добавить новый».</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/1.png') ?>" alt="img" width="600"></p>
        <p>1.2. Введите ключевое слово «BackUpWordpress» в поисковую строку и нажмите на «Установить» в появившейся на
            экране карточке плагина.</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/2.png') ?>" alt="img" width="600"></p>
        <p>1.3. Активируйте плагин кликом по соответствующей кнопке.</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/3.png') ?>" alt="img" width="600"></p>
        <p>1.4. CMS автоматически перенаправит вас на страницу управления плагинами. Чтобы приступить к резервному
            копированию, достаточно перейти по ссылке «Tools» – «Backups», либо воспользоваться главным меню WordPress
            («Инструменты» – «Резервные копии»).</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/4.png') ?>" alt="img" width="600"></p>
        <p><strong>2. Создание резервной копии</strong></p>
        <p>2.1. Базовые настройки по умолчанию для наших целей не подходят. Чтобы их изменить, перейдите в
            соответствующее меню, щелкнув по ссылке «Настройки».</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/5.png') ?>" alt="img" width="600"></p>
        <p>2.2. По умолчанию BackUpWordpress создает резервную копию базы данных. Чтобы сделать бэкап всего сайта,
            необходимо в графе «Резервные копии» выбрать опцию «База данных & файлы».</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/6.png') ?>" alt="img" width="600"></p>
        <p>2.3 Выбрав нужную опцию, кликните по кнопке «Готово» в нижней части экрана.</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/7.png') ?>" alt="img" width="600"></p>
        <p>2.4. Для создания резервной копии нажмите на «Запустить сейчас» и дождитесь окончания выполнения скрипта.</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/8.png') ?>" alt="img" width="600"></p>
        <p><strong>3. Загрузка резервной копии</strong></p>
        <p>Созданная резервная копия появится в списке на главной странице плагина. Чтобы скачать ее на свой компьютер,
            кликните по «Загрузить».</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/9.png') ?>" alt="img" width="600"></p>
        <p><strong>Дополнительные возможности плагина BackUpWordpress</strong></p>
        <p>BackUpWordpress обладает рядом дополнительных опций, которые доступны его пользователям абсолютно бесплатно.
            Рассмотрим, что предлагают разработчики плагина.</p>
        <p><strong>1. Резервное копирование по расписанию</strong></p>
        <p>На странице настроек плагина можно задать параметры резервного копирования по расписанию (каждый час, раз в
            день, раз в неделю и т.д.), оптимальное время (чтобы снизить нагрузку на сервер, лучше всего выбирать ночные
            часы, когда посещаемость сайта падает) и максимальное количество сохраненных резервных копий.</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/10.png') ?>" alt="img" width="600"></p>
        <p><strong>2. Пересылка отчетов и резервных копий на E-mail</strong></p>
        <p>Кроме того, вы можете указать E-mail, на который будут приходить отчеты, причем, если размер резервной копии
            не превышает 10 мегабайт, то она будет автоматически прикреплена к письму.</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/11.png') ?>" alt="img" width="600"></p>
        <p><strong>3. Управление архивированием файлов</strong></p>
        <p>Выбрав опцию «База данных & файлы», можно дополнительно настроить исключения для определенных файлов и папок.
            Для этого перед запуском резервного копирования перейдите по ссылке «Исключения».</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/12.png') ?>" alt="img" width="600"></p>
        <p>На данной странице приведен перечень всех папок и файлов в директории сайта. Чтобы запретить их добавление к
            архиву, достаточно нажать на кнопку «Исключить» напротив нужного элемента.</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/13.png') ?>" alt="img" width="600"></p>
        <p>Если вы желаете добавить исключенный ранее файл или папку в список архивируемых, просто нажмите на «Отменить
            исключение».</p>
        <p><img src="<?php WP01_Content::the_image_src('backupwordpress/14.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">В) Через плагин Duplicator — WordPress Migration Plugin</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Резервное копирование с помощью плагина Duplicator</strong></p>
        <p>Duplicator является одним из наиболее удобных плагинов резервного копирования WordPress для новичков, так как
            позволяет создать полную резервную копию файлов и базы данных сайтах, которая может быть развернута с нуля с
            помощью фирменного скрипта-установщика. Благодаря этому он идеально подходит не только для бэкапов, но и для
            переноса проекта с локального сервера на публичный, либо для переезда на другой хостинг. Плагин доступен в
            двух версиях: бесплатной и Pro. В последней внедрена поддержка автоматического сохранения бэкапов в облачных
            хранилищах и создание резервных копий, совместимых с форматом популярной панели для управления хостингом
            cPanel. Разберемся, как работать с этим расширением.</p>
        <p><strong>1. Установка и активация</strong></p>
        <p>1.1. Зайдя в админ-панель сайта, перейдите в раздел «Плагины» и нажмите на «Добавить новый».</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/1.png') ?>" alt="img" width="600"></p>
        <p>1.2. В поисковой строке наберите ключевое слово «Duplicator» и нажмите на «Установить» в появившейся карточке
            плагина.</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/2.png') ?>" alt="img" width="600"></p>
        <p>1.3. По завершении процесса установки кликните по «Активировать».</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/3.png') ?>" alt="img" width="600"></p>
        <p>1.4. Вас автоматически перенаправит на страницу со списком установленных плагинов. Теперь чтобы попасть в
            меню создания резервных копий, достаточно перейти по ссылке «Управлять».</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/4.png') ?>" alt="img" width="600"></p>
        <p><strong>2. Создание резервной копии</strong></p>
        <p>2.1. В меню Duplicator нажмите на кнопку «Создать новый». </p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/5.png') ?>" alt="img" width="600"></p>
        <p>2.2. В следующем окне плагин предложит настроить параметры резервного копирования. По умолчанию создается
            бэкап всех файлов сайта и базы данных, а сам архив получает название вида «ГГГГММДД_имясайта», однако, вы
            можете указать любое другое. После этого нажмите на кнопку «Далее».</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/6.png') ?>" alt="img" width="600"></p>
        <p>2.3. На следующем этапе Duplicator проверяет настройки сервера. Если все в порядке, то вы увидите на экране
            следующую картинку и можете сразу же нажать на кнопку «Создание».</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/7.png') ?>" alt="img" width="600"></p>
        <p>На некоторых хостингах может выскочить надпись «Обнаружены предупреждения». Если их важность соответствует
            уровню «заметка», проставьте галочку в чекбокс «Да, продолжить процесс построения» и кликните на «Создание».
            При наличии критических замечаний обратитесь к администратору хостинга: очевидно, действующие настройки
            сервера будут препятствовать созданию резервной копии.</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/8.png') ?>" alt="img" width="600"></p>
        <p>2.4. Начнется процесс формирования архива. Ни в коем случае не закрывайте страницу до его окончания — это
            прервет выполнение скрипта.</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/9.png') ?>" alt="img" width="600"></p>
        <p><strong>3. Загрузка резервной копии</strong></p>
        <p>После успешного создания пакета плагин предложит скачать архив, установщик (специальный скрипт, необходимый
            для восстановления резервной копии сайта с нуля) или оба файла сразу. Опция «Скачать в одно нажатие» может
            не сработать, если в вашем браузере заблокированы всплывающие окна. В этом случае скачайте установщик и
            архив отдельно.</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/10.png') ?>" alt="img" width="600"></p>
        <p>В будущем вы сможете также найти и скачать резервную копию и установщик в списке на главной странице
            плагина.</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/11.png') ?>" alt="img" width="600"></p>
        <p><strong>Дополнительные возможности плагина Duplicator</strong></p>
        <p>Перед началом резервного копирования Duplicator позволяет выбрать дополнительные опции, которые могут
            пригодиться опытным пользователям:</p>
        <ul>
            <li>Вкладка «Хранилище»</li>
        </ul>
        <p>Здесь в Pro-версии Duplicator можно подключить один из популярных cloud-сервисов (DropBox, Google Drive,
            OneDrive и ряд других). В этом случае бэкап будет автоматически загружаться в удаленное хранилище при
            создании.</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/12.png') ?>" alt="img" width="600"></p>
        <ul>
            <li>Вкладка «Архив» – «Файлы»</li>
        </ul>
        <p>Управляет параметрами архивирования. Поставьте галочку напротив «Архивировать ТОЛЬКО базу данных», если не
            желаете сохранять файлы сайта. Опция «Включить фильтр файлов» позволяет выбрать определенные папки,
            расширения (актуально, например, для получения резервных копий картинок или видео) или конкретные файлы.</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/13.png') ?>" alt="img" width="600"></p>
        <ul>
            <li>Вкладка «Архив» – «База данных»</li>
        </ul>
        <p>Поставив галочку в чекбокс «Включить фильтры таблицы», вы сможете избирательно заархивировать определенные
            таблицы базы данных, выбрав нужные из списка.</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/14.png') ?>" alt="img" width="600"></p>
        <ul>
            <li>Вкладка «Установщик»</li>
        </ul>
        <p>Поставив галочку напротив «Enable Password Protection», вы сможете защитить резервную копию паролем
            (актуально, если вы храните бэкап на рабочем компьютере или в облаке), а на вкладке «Basic» можно заранее
            указать данные для подключения к серверу MySQL. Вкладка «cPanel» доступна лишь в Pro-версии и позволяет
            создавать бэкапы, совместимые с одноименной панелью управления хостингом.</p>
        <p><img src="<?php WP01_Content::the_image_src('duplicator/15.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<br>
<h4>II. Рассмотрим способы создания раздельных бэкапов (отдельно MySQL и FTP):</h4>

<h4>бэкап FTP:</h4>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">А) Через файловый менеджер</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Копирование файлов сайта с использованием FTP-клиента FileZilla</strong></p>
        <p>Для создания резервной копии файлов сайта вам потребуется специализированный FTP-клиент. Наиболее популярным
            решением в среде веб-мастеров является FileZilla. Данная программа проста в освоении, функциональна, а
            главное — абсолютно бесплатна. Давайте научимся ей пользоваться.</p>
        <p>1. Скачайте программу с официального сайта проекта <a href="https://filezilla-project.org/download.php?type=client" target="_blank">https://filezilla-project.org/download.php?type=client</a> и
            установите на свой компьютер. Нас интересует именно «FileZilla Client».</p>
        <p><img src="<?php WP01_Content::the_image_src('ftp/0.png') ?>" alt="img" width="600"></p>
        <p>2. Запустите программу двойным щелчком мыши и подключитесь к серверу по FTP-протоколу, заполнив необходимые
            поля и затем нажав на кнопку «Быстрое соединение».</p>
        <p><img src="<?php WP01_Content::the_image_src('ftp/1.png') ?>" alt="img" width="600"></p>
        <p>Данные для входа можно получить у вашего хостинг-провайдера. Как правило, в поле «Хост» достаточно вписать
            адрес сайта, либо IP-адрес сервера, а поле «Порт» оставляют пустым (в этом случае происходит автоматическое
            подключение к 21-му порту, на котором и функционирует FTP).</p>
        <p>3. В блоке «Удаленный сайт» (расположен справа) выберите папку с файлами WordPress. Обычно она имеет вид
            «имя_сайта/public_html», «имя_сайта/www» или «имя_сайта/doc» (например, в нашем случае —
            wp01.ru/public_html). После входа в данную директорию ниже отобразится список всех файлов вашего сайта.</p>
        <p>В левом блоке («Локальный сайт») перейдите в папку на своем компьютере, куда хотите сохранить резервную
            копию. На скриншоте ниже это WP01_backup.</p>
        <p><img src="<?php WP01_Content::the_image_src('ftp/2.png') ?>" alt="img" width="600"></p>
        <p>4. Кликните мышкой в правом нижнем блоке, где выводится список всех файлов сайта, нажмите на клавиатуре
            комбинацию клавиш «Ctrl+A», чтобы выделить все файлы в директории, щелкните по выделению правой кнопкой мыши
            и выберите в контекстном меню «Скачать».</p>
        <p><img src="<?php WP01_Content::the_image_src('ftp/3.png') ?>" alt="img" width="600"></p>
        <p>5. Начнется копирование файлов, скорость которого зависит от их количества, размера, пропускной способности
            сервера и вашего интернет-соединения. Дождитесь его окончания.</p>
        <p><img src="<?php WP01_Content::the_image_src('ftp/4.png') ?>" alt="img" width="600"></p>
        <p>6. По завершении процедуры в системном трее появится сообщение об успехе.</p>
        <p><img src="<?php WP01_Content::the_image_src('ftp/5.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">Б) Через менеджер файлов в ISPmanager</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Получение резервной копии файлов сайта через панель управления хостингом ISPmanager</strong></p>
        <p>Для панели управления хостингом ISPmanager был разработан собственный файловый менеджер, позволяющий, в том
            числе, создавать резервные копии файлов сайта вручную. Посмотрим, как он работает.</p>
        <p>1. Перейдите в панель управления по ссылке, предоставленной хостером, и авторизуйтесь. Обычно она имеет вид
            «имя_сайта:1500/ispmgr» или «имя_сайта/manager/ispmgr», однако, у разных провайдеров адрес панели может
            отличаться.</p>
        <p><img src="<?php WP01_Content::the_image_src('isp/1.png') ?>" alt="img" width="600"></p>
        <p>2. Выберите в меню «Менеджер файлов».</p>
        <p><img src="<?php WP01_Content::the_image_src('isp/2.png') ?>" alt="img" width="600"></p>
        <p>3. Перейдите в корневой каталог сайта, резервную копию которого хотите создать. Нужные нам файлы обычно
            находятся в каталоге «имя_сайта/www», «имя_сайта/doc» или «имя_сайта/public_html».</p>
        <p><img src="<?php WP01_Content::the_image_src('isp/3.png') ?>" alt="img" width="600"></p>
        <p>4. Выделите папку (в нашем примере это public_html), нажмите на «Скачать» на панели инструментов.</p>
        <p><img src="<?php WP01_Content::the_image_src('isp/4.png') ?>" alt="img" width="600"></p>
        <p>5. Подтвердите выбор, щелкнув по «Ok» во всплывающем окне и сохраните файл на компьютер.</p>
        <p><img src="<?php WP01_Content::the_image_src('isp/5.png') ?>" alt="img" width="600"></p>
        <div class="notice notice-warning inline">
            <p>
                <strong>Важно!</strong><br>
                На некоторых хостингах пользователи имеют доступ лишь непосредственно к директориям «www», «doc» или
                «public_html». В этом случае выделите все файлы и папки WordPress, воспользовавшись следующим приемом:
                кликните по первому в списке файлу или папке (обычно это — папка wp-admin), прокрутите список файлов
                вниз, зажмите клавишу Shift, затем кликните по последнему файлу в списке (как правило, это xmlrpc.php).
                Далее кликните по кнопке «Скачать» на панели инструментов.
            </p>
        </div>
        <p><img src="<?php WP01_Content::the_image_src('isp/6.png') ?>" alt="img" width="600"></p>
        <p>Нажмите на «Ok» во всплывающем окне и сохраните сформированный архив на свой компьютер.</p>
        <p><img src="<?php WP01_Content::the_image_src('isp/7.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">В) Через менеджер файлов в cPanel</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Получение резервной копии файлов сайта через панель управления хостингом cPanel</strong></p>
        <p>Любой хостинг, использующий панель управления cPanel, позволяет скачать файлы принадлежащих вам веб-сайтов
            непосредственно из браузера с помощью встроенного файлового менеджера. Разберемся, как это делается.</p>
        <p>1. Используйте логин и пароль, полученные от провайдера, чтобы авторизоваться в cPanel. В блоке «Файлы»
            кликните по «Диспетчер файлов».</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel2/1.png') ?>" alt="img" width="600"></p>
        <p>2. Перейдите в корневой каталог вашего сайта. Как правило, он располагается в папке
            /home/имя_сайта/public_html.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel2/2.png') ?>" alt="img" width="600"></p>
        <p>3. Кликните по кнопке «Выбрать все» на панели инструментов.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel2/3.png') ?>" alt="img" width="600"></p>
        <p>4. Нажмите на «Сжать», чтобы создать архив, включающий выделенные файлы.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel2/4.png') ?>" alt="img" width="600"></p>
        <p>5. Во всплывающем окне можно выбрать формат архива (по умолчанию zip). Для начала архивации кликните по
            «Compress File(s)».</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel2/5.png') ?>" alt="img" width="600"></p>
        <p>6. Дождитесь окончания процедуры архивации. Об ее завершении уведомит всплывающее окно «Compression results»,
            содержащее информацию о сжатых файлах и папках. Нажмите на «Close», чтобы закрыть окно.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel2/6.png') ?>" alt="img" width="600"></p>
        <p>7. Найдите получившийся архив (проще всего это сделать по дате создания), выделите щелчком левой кнопки мыши,
            нажмите на «Скачать» на панели инструментов и сохраните архив на компьютер.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel2/7.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">Г) Через менеджер файлов в DirectAdmin</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Получение резервной копии файлов сайта через панель управления хостингом DirectAdmin</strong></p>
        <p>Популярная панель управления хостингом DirectAdmin имеет в своем составе собственный файловый менеджер, 
		благодаря чему при работе с ней полностью отпадает потребность в FTP-клиентах. Рассмотрим, как создать резервную 
		копию файлов сайта, используя встроенный веб-интерфейс.</p>
        <p>1. Авторизуйтесь в панели управления, выберите в меню «Система и файлы» пункт «Менеджер файлов».</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin2/1.png') ?>" alt="img" width="600"></p>
        <p>2. Перейдите в корневую папку сайта. Как правило, путь до нее выглядит, как «имя_сайта/public_html», 
		«имя_сайта/www» или «имя_сайта/doc». </p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin2/2.png') ?>" alt="img" width="600"></p>
        <p>3. Открыв папку, проставьте галочку в чекбокс напротив заголовка столбца «Имя файла»: это позволит выбрать 
		одновременно все файлы и подпапки, имеющиеся в данной директории.</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin2/3.png') ?>" alt="img" width="600"></p>
        <p>4. DirectAdmin не производит действий с файлами напрямую, а обрабатывает их в буфере обмена. Поэтому после 
		того, как вы выделили все файлы, кликните по кнопке «Буфер обмена».</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin2/4.png') ?>" alt="img" width="600"></p>
        <p>5. В нижней части страницы разверните список «Действия с буфером обмена» и выберите «Сжатие файлов».</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin2/5.png') ?>" alt="img" width="600"></p>
        <p>6. Во всплывающем окне введите имя резервной копии и выберите формат архива, затем нажмите на «Сжатие».</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin2/6.png') ?>" alt="img" width="600"></p>
        <p>7. Ожидайте, пока на экране не появится уведомление об успешном завершении создания архива.</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin2/7.png') ?>" alt="img" width="600"></p>
        <p>8. Архив с резервной копией появится в корневом каталоге сайта. Чтобы его скачать, кликните по названию 
		архива левой кнопкой, после чего загрузка файла начнется автоматически.</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin2/8.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>

<h4>бэкап MySQL:</h4>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">А) Через панель phpMyAdmin</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Создание резервной копии базы данных сайта в phpMyAdmin</strong></p>
        <p>Для управления базами данных сайтов большинство хостеров предлагает удобный скрипт phpMyAdmin, позволяющий в
            том числе создавать их резервные копии. Для этого достаточно совершить несколько простых шагов.</p>
        <p>1. Авторизуйтесь в phpMyAdmin. Как правило попасть в админку можно по ссылке вида «имя_сайта/phpmyadmin» (в
            нашем случае это будет http://wp01.ru/phpmyadmin).</p>
        <p><img src="<?php WP01_Content::the_image_src('phpmyadmin/1.png') ?>" alt="img" width="600"></p>
        <p>Точные данные для доступа следует уточнить у вашего провайдера. Также вы можете узнать пару логин/пароль,
            просмотрев файл wp-config.php, который находится в корневой папке сайта. Логин расположен в строке
            define('DB_USER', 'login');, а пароль — в строке define('DB_PASSWORD', 'password');. В нашем примере логин —
            это admin, а пароль — 12345.</p>
        <p><img src="<?php WP01_Content::the_image_src('phpmyadmin/2.png') ?>" alt="img" width="600"></p>
        <p>2. Выберите базу данных вашего сайта в колонке слева (в нашем примере она носит название wp01.ru).</p>
        <p><img src="<?php WP01_Content::the_image_src('phpmyadmin/3.png') ?>" alt="img" width="600"></p>
        <p>3. Перейдите во вкладку «Экспорт».</p>
        <p><img src="<?php WP01_Content::the_image_src('phpmyadmin/4.png') ?>" alt="img" width="600"></p>
        <p>4. Нажмите на кнопку «Вперед» и сохраните файл на компьютер. Резервная копия базы данных готова!</p>
        <p><img src="<?php WP01_Content::the_image_src('phpmyadmin/5.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">Б) Через управление базой в ISPmanager</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Получение резервной копии базы данных сайта через панель управления хостингом ISPmanager</strong></p>
        <p>ISPmanager имеет встроенную систему управления базами данных MySQL и позволяет вручную создавать их резервные
            копии через наглядный веб-интерфейс. Это делается следующим образом.</p>
        <p>1. Авторизуйтесь в панели управления. Как правило, она располагается по адресу «имя_сайта:1500/ispmgr» или
            «имя_сайта/manager/ispmgr», однако, у разных хостеров путь к панели может отличаться, поэтому данные для
            входа следует уточнить у вашего провайдера.</p>
        <p><img src="<?php WP01_Content::the_image_src('isp2/1.png') ?>" alt="img" width="600"></p>
        <p>2. В левом меню откройте блок «Инструменты» и кликните по строчке «Базы данных».</p>
        <p><img src="<?php WP01_Content::the_image_src('isp2/2.png') ?>" alt="img" width="600"></p>
        <p>3. Выделите щелчком мыши нужную базу данных, затем нажмите на «Скачать» на панели инструментов и сохраните
            файл на свой компьютер. Резервная копия базы данных готова.</p>
        <p><img src="<?php WP01_Content::the_image_src('isp2/3.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">В) Через управление базой в cPanel</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Получение резервной копии базы данных сайта через панель управления хостингом cPanel</strong></p>
        <p>Панель управления хостингом cPanel поддерживает создание резервной копии базы данных сайта непосредственно
            через веб-интерфейс. Для ее получения необходимо проделать несколько простых шагов.</p>
        <p>1. Зайдите в панель управления используя логин и пароль, полученные от провайдера, и перейдите в раздел
            «Резервная копия MySQL». </p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel3/1.png') ?>" alt="img" width="600"></p>
        <p>2. В блоке «Частичные резервные копии» – «Скачать резервную копию базы данных MySQL» кликните по названию
            нужной базы данных и сохраните файл на компьютер.</p>
        <p><img src="<?php WP01_Content::the_image_src('cpanel3/2.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">Г) Через управление базой в DirectAdmin</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Получение резервной копии базы данных сайта через панель управления хостингом DirectAdmin</strong>
        </p>
        <p>Панель управления хостингом DirectAdmin позволяет управлять базами данных ваших сайтов с помощью удобного 
		веб-интерфейса. Чтобы создать резервную копию базы данных, выполните следующие действия.</p>
        <p>1. Авторизуйтесь в панели управления вашего хостинга и перейдите в раздел «Управление MySQL».</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin3/1.png') ?>" alt="img" width="600"></p>
        <p>2. Найдите в списке нужную базу данных, кликните по «Скачать» и сохраните файл на свой компьютер. 
		Вы получите резервную копию базы данных, упакованную в архив с расширением .gz.</p>
        <p><img src="<?php WP01_Content::the_image_src('directadmin3/2.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">Д) Через скрипт Sypex Dumper</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Создание резервной копии базы данных сайта с помощью скрипта Sypex Dumper</strong>
        </p>
        <p>Для работы с базами данных большинство хостингов предлагает пользователям скрипт phpMyAdmin. 
		При всех достоинствах, данное решение имеет существенный недостаток: размер загружаемого файла 
		не может превышать лимит, установленный провайдером в настройках сервера, вследствие чего вы не 
		сможете полноценно работать с объемными базами данных, так как восстановить созданную резервную 
		копию не получится. Решить эту проблему поможет бесплатный многофункциональный скрипт управления 
		базами данных Sypex Dumper, разработанный компанией «Биноватор». Давайте научимся им пользоваться.</p>
		<p><strong>1. Установка скрипта Sypex Dumper на сайт</strong>
        </p>
        <p>1.1. Скачайте Sypex Dumper на свой компьютер с официального сайта проекта, воспользовавшись ссылкой 
		<a href="https://sypex.net/files/SypexDumper_2011.zip" target="_blank">https://sypex.net/files/SypexDumper_2011.zip</a>. 
		Распакуйте архив в любое удобное место на диске: внутри него находится папка с файлами скрипта под названием «sxd».</p>
        <p>1.2. Загрузите FTP-клиент FileZilla с официального сайта <a href="https://filezilla-project.org/download.php?type=client" target="_blank">https://filezilla-project.org/download.php?type=client</a> 
		и установите программу на свой компьютер. Данная утилита понадобится нам для загрузки Sypex Dumper на сервер.</p>
        <p><img src="<?php WP01_Content::the_image_src('sypexdumper/1.png') ?>" alt="img" width="600"></p>
		<p>1.3. Запустите программу двойным щелчком мыши и подключитесь к серверу по FTP-протоколу, заполнив 
		необходимые поля в верхней части окна и нажав на кнопку «Быстрое соединение».</p>
        <p><img src="<?php WP01_Content::the_image_src('sypexdumper/2.png') ?>" alt="img" width="600"></p>
		<p>Данные для входа можно получить у вашего хостинг-провайдера. Как правило, в поле «Хост» достаточно вписать 
		адрес сайта без префикса http://, либо IP-адрес сервера, а поле «Порт» оставляют пустым (в этом случае происходит 
		автоматическое подключение к 21-му порту, на котором и функционирует FTP).</p>
		<p>1.4. Выберите в поле «Локальный сайт» папку, куда распаковали Sypex Dumper, а в поле «Удаленный сайт» — 
		корневой каталог вашего сайта. Обычно он носит название «имя_сайта/public_html», «имя_сайта/www» или «имя_сайта/doc» 
		(например, в нашем случае — wp01.ru/public_html).</p>
		<p><img src="<?php WP01_Content::the_image_src('sypexdumper/3.png') ?>" alt="img" width="600"></p>
		<p>1.5. Выделите папку «sxd», кликните по ней правой кнопкой мыши и выберите в контекстном меню опцию «Закачать на сервер».</p>
		<p><img src="<?php WP01_Content::the_image_src('sypexdumper/4.png') ?>" alt="img" width="600"></p>
		<p>1.6. Дождитесь завершения загрузки, о чем сообщит всплывающее окно в системном трее.</p>
		<p><img src="<?php WP01_Content::the_image_src('sypexdumper/5.png') ?>" alt="img" width="600"></p>
		<p><strong>2. Создание резервной копии базы данных</strong>
        </p>
		<p>2.1. Перейдите по ссылке имя_сайта/sxd. В нашем примере она будет выглядеть, как wp01.ru/sxd. Вы окажетесь 
		на странице авторизации, где будет необходимо ввести имя пользователя и пароль для доступа к серверу баз данных.</p>
		<p><img src="<?php WP01_Content::the_image_src('sypexdumper/6.png') ?>" alt="img" width="600"></p>
		<p>Уточнить логин и пароль можно у вашего хостинг-оператора. Кроме того, их можно подсмотреть в файле wp-config.php, 
		который располагается в корневой папке сайта. Логин указан в строке define('DB_USER'), а пароль — в define('DB_PASSWORD'). 
		В нашем примере логин — это admin, а пароль — 12345.</p>
		<p><img src="<?php WP01_Content::the_image_src('sypexdumper/7.png') ?>" alt="img" width="600"></p>
        <div class="notice notice-warning inline">
            <p>
                <strong>Внимание!</strong><br>
                Бесплатная вресия Sypex Dumper была выпущена достаточно давно, в связи с чем скрипт поддерживает PHP версии 5+, 
				и не работает с PHP 7+. Если при попытке авторизации в скрипте вы увидели белый экран или сообщение 
				«500 Internal Server Error» - воспользуйтесь альтернативным способом создания резервной копии (например, используйте 
				скрипт Adminer), либо купите платную версию Sypex Dumper (стоит порядка 10$, постоянно обновляется и поддерживает 
				все современные технологии).
            </p>
        </div>
		<p>2.2. Скрипт автоматически перенаправит вас на страницу экспорта. Выберите нужную базу данных в раскрывающемся списке 
		и нажмите на кнопку «Сохранить». Остальные настройки следует оставить без изменений.</p>
		<p><img src="<?php WP01_Content::the_image_src('sypexdumper/8.png') ?>" alt="img" width="600"></p>	
		<p>2.3. Дождитесь окончания процесса формирования бэкапа. Не закрывайте окно до того, как скрипт полностью отработает.</p>
		<p><img src="<?php WP01_Content::the_image_src('sypexdumper/9.png') ?>" alt="img" width="600"></p>
		<p><strong>3. Загрузка резервной копии</strong>
        </p>		
		<p>Чтобы сохранить резервную копию базы данных на свой компьютер, кликните по кнопке «Скачать», после чего начнется загрузка архива. 
		Сохраните бэкап в любое удобное место.</p>
		<p><img src="<?php WP01_Content::the_image_src('sypexdumper/10.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>

<div class="collapse collapsed">
    <div class="collapse-title collapse-toggler">Е) Через скрипт Adminer</div>
    <div class="collapse-body" style="display: none;">
        <p><strong>Создание резервной копии базы данных сайта с помощью скрипта Adminer</strong>
        </p>
        <p>Adminer — бесплатный высокопроизводительный скрипт для управления базами данных MySQL. В отличие от phpMyAdmin, 
		он позволяет восстанавливать резервные копии, расположенные в корневом каталоге сайта, что позволяет обойти любые 
		ограничения провайдера на размер загружаемых файлов. Еще одним преимуществом Adminer является поддержка актуальных 
		версий PHP (7 и выше), что обеспечивает стабильную работу скрипта практически на любом хостинге. Давайте научимся 
		пользоваться данным приложением.</p>
		<p><strong>1. Установка скрипта Adminer на сайт</strong>
        </p>
        <p>1.1. Загрузите Adminer на свой компьютер с официального сайта <a href="https://www.adminer.org/en/" target="_blank">https://www.adminer.org/en/</a> 
		кликнув по кнопке «Download», и сохраните скрипт в любое удобное место на диске вашего компьютера.</p>
		<p><img src="<?php WP01_Content::the_image_src('adminer/1.png') ?>" alt="img" width="600"></p>
		<p>Файл скрипта имеет название «adminer-номер-версии.php» (в нашем случае это adminer-4.7.1.php). 
		Для удобства дальнейшей работы переименуйте его в adminer.php.</p>
        <p>1.2. Скачайте с официального сайта проекта FTP-клиент FileZilla: <a href="https://filezilla-project.org/download.php?type=client" target="_blank">https://filezilla-project.org/download.php?type=client</a> 
		Данная программа понадобится нам для загрузки Adminer на сервер. Установите FileZilla на свой компьютер.</p>
        <p><img src="<?php WP01_Content::the_image_src('adminer/2.png') ?>" alt="img" width="600"></p>
		<p>1.3. Запустите FileZilla двойным щелчком мыши и подключитесь к серверу по FTP-протоколу, заполнив необходимые 
		поля в верхней части окна и кликнув по кнопке «Быстрое соединение».</p>
        <p><img src="<?php WP01_Content::the_image_src('adminer/3.png') ?>" alt="img" width="600"></p>
		<p>Логин и пароль для входа можно получить у вашего хостинг-провайдера. Обычно в поле «Хост» достаточно вписать адрес 
		сайта без префикса http://, либо указать IP-адрес сервера, а поле «Порт» оставляют пустым, так как в этом случае происходит 
		автоматическое подключение к 21-му порту, на котором и функционирует FTP.</p>
		<p>1.4. Выберите в блоке «Локальный сайт» (расположен слева) папку, в которую распаковали Adminer, а в блоке «Удаленный сайт» 
		(расположен справа) — корневой каталог вашего сайта. Как правило, он носит название «имя_сайта/public_html», «имя_сайта/www» 
		или «имя_сайта/doc» (в нашем случае — wp01.ru/public_html).</p>
		<p><img src="<?php WP01_Content::the_image_src('adminer/4.png') ?>" alt="img" width="600"></p>
		<p>1.5. Выделите файл adminer.php, кликните по нему правой кнопкой мыши и выберите в контекстном меню опцию «Закачать на сервер».</p>
		<p><img src="<?php WP01_Content::the_image_src('adminer/5.png') ?>" alt="img" width="600"></p>
		<p>1.6. Дождитесь завершения загрузки. Об успешном окончании процесса сообщит всплывающее окно в системном трее.</p>
		<p><img src="<?php WP01_Content::the_image_src('adminer/6.png') ?>" alt="img" width="600"></p>
		<p><strong>2. Подготовка к созданию резервной копии базы данных</strong>
        </p>
		<p>2.1. Перейдите по ссылке имя_сайта/adminer.php. В нашем примере она будет выглядеть, как wp01.ru/adminer.php. 
		Вы окажетесь на странице авторизации, где будет необходимо ввести имя пользователя, пароль и название базы данных.</p>
		<p><img src="<?php WP01_Content::the_image_src('adminer/7.png') ?>" alt="img" width="600"></p>
		<p>Уточнить имя базы данных, логин и пароль можно у вашего хостинг-оператора. Кроме того, их можно подсмотреть в файле 
		wp-config.php, который располагается в корневой папке сайта. Название базы данных указано в строке define('DB_NAME'), 
		логин — в строке define('DB_USER'), а пароль — в define('DB_PASSWORD'). В нашем примере имя базы данных — это wp01.ru, 
		логин — admin, а пароль — 12345.</p>
		<p><img src="<?php WP01_Content::the_image_src('adminer/8.png') ?>" alt="img" width="600"></p>
		<p>2.2. В меню управления базой данных кликните по опции «Экспорт» в левой части экрана.</p>
		<p><img src="<?php WP01_Content::the_image_src('adminer/9.png') ?>" alt="img" width="600"></p>	
		<p>2.3. Отметьте радиокнопкой опцию «Сохранить», либо «Gzip». В первом случае скрипт подготовит для вас резервную копию базы 
		данных в формате SQL, во втором дополнительно заархивирует бэкап, что поможет сэкономить место на диске и защитить файл от 
		повреждения при скачивании (это особенно актуально, если база данных имеет большие размеры). Также убедитесь в наличии галочек 
		в чекбоксах «Таблицы» и «Данные». Остальные настройки рекомендуем оставить без изменений.</p>
		<p><img src="<?php WP01_Content::the_image_src('adminer/10.png') ?>" alt="img" width="600"></p>
		<p><strong>3. Создание и загрузка резервной копии базы данных</strong>
        </p>		
		<p>По завершении всех подготовительных операций кликните по кнопке «Экспорт». После этого Adminer автоматически сформирует 
		резервную копию базы данных и предложит скачать ее на ваш компьютер. Сохраните полученный файл в любом удобном для вас месте.</p>
		<p><img src="<?php WP01_Content::the_image_src('adminer/11.png') ?>" alt="img" width="600"></p>
        <p><a href="#" class="collapse-toggler">Свернуть</a></p>
    </div>
</div>
		